Tekla Open API Reference for Tekla Structures 2025
FrameTypes Enumeration
 The available frame styles around the object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum FrameTypes
Public Enumeration FrameTypes
Members
Member name | Value | Description
None | 0 |  No frame.
Rectangular | 1 |  The rectangular frame.
Line | 2 |  A line under the object.
Round | 3 |  The frame with rounded ends.
Circle | 4 |  The circular frame.
Diamond | 5 |  The frame looking like a diamond.
Hexagon | 6 |  The hexagonally shaped frame.
Triangle | 7 |  The triangular frame.
Sharpened | 8 |  The frame with sharpened ends.
See Also
Reference
Tekla.Structures.Drawing Namespace